1.5 Операции с целыми числами

e.g. Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
11111⋅1111111
— произведение чисел 11111 (5 единиц) и 1111111 (7 единиц)
print(int('1' * 5) * int('1' * 7))

1.6 Операции с вещественными числами
e.g. Запишите число 1.2345e3 в виде десятичной дроби.
См. экспоненциальная запись.
print(1.2345e3) 

1.7 Типы данных
e.g. print(int(2.99)) == 2 
e.g. print(int(-1.6)) == -1 

1.8 Переменные. Стандартный ввод/вывод

e.g.
Коля каждый день ложится спать ровно в полночь и недавно узнал, что оптимальное время для его сна составляет 
X
X минут. Коля хочет поставить себе будильник так, чтобы он прозвенел ровно через 
X
X минут после полуночи, однако для этого необходимо указать время сигнала в формате часы, минуты. Помогите Коле определить, на какое время завести будильник.

Часы и минуты в выводе программы должны располагаться на разных строках (см. пример работы программы)

Помните, что для считывания данных нужно вызывать функцию input без аргументов!

Sample Input 1:
480
Sample Output 1:
8
0

print(*divmod(int(input()), 60), sep='\n')


e.g.
Катя узнала, что ей для сна надо 
X
X минут. В отличие от Коли, Катя ложится спать после полуночи в 
H
H часов и 
M
M минут. Помогите Кате определить, на какое время ей поставить будильник, чтобы он прозвенел ровно через 
X
X минут после того, как она ляжет спать.

На стандартный ввод, каждое в своей строке, подаются значения 
X
X, 
H
H и 
M
M. Гарантируется, что Катя должна проснуться в тот же день, что и заснуть. Программа должна выводить время, на которое нужно поставить будильник: в первой строке часы, во второй — минуты.

Sample Input 1:
480
1
2
Sample Output 1:
9
2

a,b,c=(int(input()) for i in range(3))
print('%s\n%s' % ((a+c)//60+b, (a+c)%60))

1.10 Условия: if, else, elif. Блоки, отступы

Из передачи “Здоровье” Аня узнала, что рекомендуется спать хотя бы 
A
A часов в сутки, но пересыпать тоже вредно и не стоит спать более 
B
B часов. Сейчас Аня спит 
H
H часов в сутки. Если режим сна Ани удовлетворяет рекомендациям передачи “Здоровье”, выведите “Это нормально”. Если Аня спит менее 
A
A часов, выведите “Недосып”, если же более 
B
B часов, то выведите “Пересып”.

Получаемое число 
A
A всегда меньше либо равно 
B
B.

На вход программе в три строки подаются переменные в следующем порядке: 
A
A, 
B
B, 
H
H.

Обратите внимание на регистр символов: вывод должен в точности соответствовать описанному в задании, т. е. если программа должна вывести "Пересып", выводы программы "пересып", "ПЕРЕСЫП", "ПеРеСыП" и другие не будут считаться верными.

Это первое не самое тривиальное задание на условное выражение. В случаях, когда разбить исполнение программы на несколько направлений, стоит внимательно обдумать все условия, которые нужно использовать. Особое внимание стоит уделить строгости используемых условных операторов: различайте 
<
< и 
≤
≤; 
>
> и 
≥
≥. Для того, чтобы понимать, какой из них стоит использовать, внимательно прочитайте условие задания.

Sample Input 1:
6
10
8
Sample Output 1:
Это нормально


a, b, h = (int(input()) for _ in range(3))
print('Это нормально'*(a <= h <= b) + 'Недосып'*(h < a) + 'Пересып'*(h > b))


1.12 Задачи по материалам недели

Одна проблема: так как эта формула не нравилась Павлу, он её не запомнил. Помогите ему завершить доброе дело и напишите программу, вычисляющую площадь треугольника по переданным длинам трёх его сторон по формуле Герона:

exec("print(((({0}+{1}+{2})/2)*(({0}+{1}+{2})/2-{0})*(({0}+{1}+{2})/2-{1})*(({0}+{1}+{2})/2-{2}))**(1/2))".format(float(input()),float(input()),float(input())))

e.g. Напишите программу, принимающую на вход целое число, которая выводит True, если переданное значение попадает в интервал 
(
−
15
,
12
]
∪
(
14
,
17
)
∪
[
19
,
+
∞
)
(−15,12]∪(14,17)∪[19,+∞) и False в противном случае (регистр символов имеет значение).

n = int(input())
print(-15 < n <= 12 or 14 < n < 17 or 19 <= n)

e.g. Напишите простой калькулятор, который считывает с пользовательского ввода три строки: первое число, второе число и операцию, после чего применяет операцию к введённым числам ("первое число" "операция" "второе число") и выводит результат на экран.

Поддерживаемые операции: +, -, /, *, mod, pow, div, где
mod — это взятие остатка от деления,
pow — возведение в степень,
div — целочисленное деление.

Если выполняется деление и второе число равно 0, необходимо выводить строку "Деление на 0!".

Обратите внимание, что на вход программе приходят вещественные числа.

a, b, op = input(), input(), input()
print ("Деление на 0!" if op in ("/", "div", "mod") and float(b) == 0 else eval("({0}){1}".format(a, {'pow':'**', 'div':'//', 'mod':'%'}.get(op, op) + b)))

e.g. Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.

Формат ввода, который используют Малевийцы:

треугольник
a
b
c

                  
где a, b и c — длины сторон треугольника

прямоугольник
a
b

                  
где a и b — длины сторон прямоугольника

круг
r

                  
где r — радиус окружности


f=input()
S={'треугольник':[3, lambda a, b, c: (((a+b+c)/2)*(((a+b+c)/2)-a)*(((a+b+c)/2)-b)*(((a+b+c)/2)-c))**0.5],
   'прямоугольник':[2, lambda a, b: a*b], 
   'круг':[1, lambda a: 3.14*a**2]}
args=[float(input()) for i in range (S[f][0])]
print(S[f][1](*args))

e.g. Напишите программу, которая получает на вход три целых числа, по одному числу в строке, и выводит на консоль в три строки сначала максимальное, потом минимальное, после чего оставшееся число.

На ввод могут подаваться и повторяющиеся числа.

x=sorted([int(input()),int(input()),int(input())])
print (x[2], x[0], x[1], sep="\n")

e.g. В институте биоинформатики по офису передвигается робот. Недавно студенты из группы программистов написали для него программу, по которой робот, когда заходит в комнату, считает количество программистов в ней и произносит его вслух: "n программистов".

Для того, чтобы это звучало правильно, для каждого 
n
n нужно использовать верное окончание слова.

Напишите программу, считывающую с пользовательского ввода целое число 
n
n (неотрицательное), выводящее это число в консоль вместе с правильным образом изменённым словом "программист", для того, чтобы робот мог нормально общаться с людьми, например: 1 программист, 2 программиста, 5 программистов.


dic, n = {'1': '', '2': 'а', '3': 'а', '4': 'а'}, input()
print(n, 'программист'+(dic.get(n[-1], 'ов') if not 10 < int(n[-2::]) < 20 else 'ов'))

или

n=int(input())
print(n,'программист'+('ов' if n%10==0 or 4<n%10<10 or 10<n%100<15 else 'а' if 1<n%10<5 else ''))

e.g.
Паша очень любит кататься на общественном транспорте, а получая билет, сразу проверяет, счастливый ли ему попался. Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера билета.

Однако Паша очень плохо считает в уме, поэтому попросил вас написать программу, которая проверит равенство сумм и выведет "Счастливый", если суммы совпадают, и "Обычный", если суммы различны.

На вход программе подаётся строка из шести цифр.

Выводить нужно только слово "Счастливый" или "Обычный", с большой буквы.

n=int(input())
print("Счастливый" if n//100000+n//10000%10+n//1000%10==n//100%10+n//10%10+n%10 else "Обычный")
